package com.yuroyoro.esoteric.grass

object VvzrApp extends SampleApp {
  lazy val programName = "プログラミング言語 ブブゼラ"

  lazy val wTokens = List("ェ")
  lazy val fTokens = List("エ")
  lazy val vTokens = List("ベ")

  lazy val printW = "ヴェエエェェェェ"
  lazy val printX = "ヴェエエエェェェェエエエェ"
  lazy val helloworld =  """ヴェ ベ ェエェェェェエェェェェェェエエエエエェエエエエエェェェェ ベ ェェェェエエエェェエェェエエエヴエエエェェェェエェェ ベ ェエエェエェェ ベ ェェエエェ ベ ェエエエェェエエエエエェェェエェヴェエエエエエエェエエエエエエエェエエエエヴェエエエエエェエエエエエエェエエエエエエエエエエエエエエェェェェェェェェエェエェエエエェェエエエエェェェェェェェエエエエエヴェェェェェェェエエエエエエェェェェェェェエエエエエエエエエエエエエエエエエエエエエェェェェェヴェェェェェェェェェェェェェェェェエェェェェェェェェェェェェェェェェェェェェエェェェェェェェェェェェェェエェェェェェェエエェェェェェェエエエェェェェヴェェエエエエエエェェェェェェェェェェェェェェェェェェェェエェェェェェェェェェェエエェェェェエヴエエェェェェエエエエェエエエエエェェェェェェェェェェェェェェェェェェエエエエエエエエエエエェエェェェエエェエエエェエエエヴエェエエエエエエエエエエエエヴエエエエエェェェェェェェェェェェェェェェェェエェェェェェェェェェェェェェェェェェェェェェェェェェェェェェェェェェェェェェヴェエェェェェェェェェェェェエエェェェェェェェェェェェエエエェェェェェェェエエエエェエエヴエエヴエェェェェェェェェエエエエヴエエェェェェェェェェェェェェェェェェェェェェェエエエエエエエェェェェェェェェェェェェェェェェェェェェェェェェェェェェエエヴエエエエエエエェェェェェェェェエェェェェェェェェェェェェェェェェェェェェェェェェェェェェェェェェエエェェェェェェェェェェヴェェェエエエェェェェェェェェェェェェェエエエエェェェェェェェェエエエエエェェェェェェェェェヴェェェェェェェェェェェェェェェヴェェエエエエエエェェェェェェェェェェェェェェェェェェェェェェェェェ"""
}
